import type { Lines } from '../types/constants';
export const lines: Lines = [
  [
    { y: 0, x: 0 },
    { y: 0, x: 1 },
    { y: 0, x: 2 },
  ], // 上の横列
  [
    { y: 1, x: 0 },
    { y: 1, x: 1 },
    { y: 1, x: 2 },
  ], // 中央の横列
  [
    { y: 2, x: 0 },
    { y: 2, x: 1 },
    { y: 2, x: 2 },
  ], // 下の横列
  [
    { y: 0, x: 0 },
    { y: 1, x: 0 },
    { y: 2, x: 0 },
  ], // 左の縦列
  [
    { y: 0, x: 1 },
    { y: 1, x: 1 },
    { y: 2, x: 1 },
  ], // 中央の縦列
  [
    { y: 0, x: 2 },
    { y: 1, x: 2 },
    { y: 2, x: 2 },
  ], // 右の縦列
  [
    { y: 0, x: 0 },
    { y: 1, x: 1 },
    { y: 2, x: 2 },
  ], // 左上から右下への対角線
  [
    { y: 0, x: 2 },
    { y: 1, x: 1 },
    { y: 2, x: 0 },
  ], // 右上から左下への対角線
];
